; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 52621 2 3 2 8 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph1 - mode
	Star3 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Star4 - direction
	GroundStation1 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star5)
	(supports instrument3 image0)
	(calibration_target instrument3 Star4)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(have_image Phenomenon8 image0)
	(have_image Phenomenon9 image0)
	(have_image Planet10 image0)
	(have_image Planet11 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
3. (turn_to satellite0 planet11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet11)
   goals met: 0 of 4
4. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 4
5. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 0 of 4
6. (turn_to satellite1 planet11 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet11)
   goals met: 0 of 4
7. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 4
8. (take_image satellite1 planet11 instrument3 image0)
   added: (have_image planet11 image0)
   goals met: 1 of 4
9. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 4
10. (turn_to satellite1 planet10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet10)
   goals met: 1 of 4
11. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 4
12. (take_image satellite1 planet10 instrument3 image0)
   added: (have_image planet10 image0)
   goals met: 2 of 4
13. (turn_to satellite0 groundstation0 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 4
14. (turn_to satellite1 phenomenon8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 4
15. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 4
16. (take_image satellite1 phenomenon8 instrument3 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 4
17. (turn_to satellite0 phenomenon9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 4
18. (take_image satellite0 phenomenon9 instrument0 image0)
   added: (have_image phenomenon9 image0)
   goals met: 4 of 4
